app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    session[:store_counter] = 0


    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 14 Nov 2011 00:13:35 UTC +00:00], ["updated_at", Mon, 14 Nov 2011 00:13:35 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Mon, 14 Nov 2011 02:17:00 UTC +00:00], ["product_id", 207281424], ["quantity", 1], ["updated_at", Mon, 14 Nov 2011 02:17:00 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "total_price" = 99.9, "updated_at" = '2012-01-01 05:07:01.220032' WHERE "line_items"."id" = 25