app/controllers/store_controller.rb

  def index
    @now = Time.new
    @products = Product.order(:title)
---
SELECT "products".* FROM "products" ORDER BY title